<?php
const SITE_CONTACTS = [
    'phone' => '+7 (383) 207-82-36',
    'email' => 'info@oknareal.com',
    'address' => 'г.Новосибирск, ул. Нарымская 27, 10 этаж',
    'geo_coords' => '[55.045542,82.902787]',
    'company_name' => 'Окна Новостройки',
    'legal_company_name' => 'ООО «ОКНА-Новосибирск»',
    'instagram' => 'https://www.instagram.com/okna_novostroyki_nsk',
    'vk' => 'https://vk.com/oknanovostroykinsk',
    'ok' => 'https://ok.ru/group/55244820774942',
    'facebook' => 'https://www.facebook.com/groups/261802710882933',
];

const MAILABLE = [
    //'ads@oknareal.com'
    //'albertovna2405@mail.ru'
    'ratiborro@gmail.com'
];

const SPECIFIC_RESIDENTIALS = [
    26 => 'Аврора',
    27 => 'Матрешкин двор',
    28 => 'Лето',
    29 => 'Матрешки на правом'
];

const QUARTERS = [
    'full' => [
        1 => 'I квартал',
        2 => 'II квартал',
        3 => 'III квартал',
        4 => 'IV квартал'
    ],
    'short' => [
        1 => 'I',
        2 => 'II',
        3 => 'III',
        4 => 'IV'
    ]
];

const COMFORT_CLASSES = [
    1 => 'Эконом',
    2 => 'Комфорт',
    3 => 'Бизнес',
    4 => 'Элит'
];

const ROOMS = [
    'short' => [
        10 => 'Студия',
        11 => '1-ком.',
        20 => '2-ком. ст.',
        21 => '2-ком.',
        30 => '3-ком. ст.',
        31 => '3-ком.',
        40 => '4-ком. ст.',
        41 => '4-ком.',
        50 => '5-ком. ст.',
        51 => '5-ком.',
        60 => '6-ком. ст.',
        61 => '6-ком.',
        70 => '7-ком. ст.',
        71 => '7-ком.',
        98 => 'Таунхаус',
        99 => 'Своб. пл.'
    ],
    'full' => [
        10 => 'Студия',
        11 => '1-комнатная',
        20 => '2-комнатная студия',
        21 => '2-комнатная',
        30 => '3-комнатная студия',
        31 => '3-комнатная',
        40 => '4-комнатная студия',
        41 => '4-комнатная',
        50 => '5-комнатная студия',
        51 => '5-комнатная',
        60 => '6-комнатная студия',
        61 => '6-комнатная',
        70 => '7-комнатная студия',
        71 => '7-комнатная',
        98 => 'Таунхаус',
        99 => 'Свободная планировка'
    ],
    'many' => [
        10 => 'Студии',
        11 => '1-комнатные',
        20 => '2-комнатные студии',
        21 => '2-комнатные',
        30 => '3-комнатные студии',
        31 => '3-комнатные',
        40 => '4-комнатные студии',
        41 => '4-комнатные',
        50 => '5-комнатные студии',
        51 => '5-комнатные',
        60 => '6-комнатные студии',
        61 => '6-комнатные',
        70 => '7-комнатные студии',
        71 => '7-комнатные',
        98 => 'таунхаусы',
        99 => 'Со свободной планировкой'
    ]
];

const BUILDING_TYPES = [
    1 => 'ЖК',
    2 => 'Квартал',
    3 => 'МКР',
    4 => 'Район',
    5 => 'Дом',
    6 => 'Жилмассив'
];

const REQUEST_TYPES = [
    1 => 'Заявка на просмотр квартиры',
    2 => 'Заявка на ипотеку',
    3 => 'Форма обратной связи'
];